import Image from 'next/image'
import styles from './Information.module.css'

export default function Information() {
  return (
    <section className={styles.about}>
      <div className={styles.leftSection}>
        <div className={styles.textContent}>
          <h1 className={styles.title}>Корисна інформація про натуральний яблучний оцет</h1>

          <div className={styles.description}>
            <h2>Натуральний яблучний оцет</h2>
            <p>
              <strong>«Живий» яблучний оцет</strong> – це натуральний, нефільтрований та
              непастеризований продукт природного бродіння, який містить корисні бактерії та
              ферменти. Його отримують шляхом подвійного бродіння яблучного соку, що дає можливість
              зберегти більше корисних речовин, ніж фільтрований. Такий оцет має каламутний
              бурштиновий колір (темніше або світліше) і може містити осад або плівку, які є
              природними та корисними.
            </p>
            <h2>Результати досліджень натурального яблучного оцту</h2>
            <p>
              Дослідження <strong>яблучного оцту</strong> показують, що він може сприяти контролю
              рівня цукру в крові, зниженню ваги та покращенню травлення за рахунок оцтової кислоти,
              яка пригнічує апетит та покращує засвоєння поживних речовин. Також існують дані про
              позитивний вплив на серцево-судинну систему та антибактеріальні властивості, але деякі
              результати вимагають додаткового підтвердження масштабними дослідженнями.
            </p>
            <h2>Користні властивості натурального яблучного оцту</h2>
            <p>
              Контроль ваги. Деякі дослідження показують, що <strong>яблучний оцет</strong> може
              знижувати апетит та сприяти втраті жиру, але ефект може бути незначним у
              довгостроковій перспективі без зміни дієти. Покращення травлення. Оцтова кислота
              стимулює вироблення шлункового соку та сприяє розщепленню жирів та білків, що може
              зменшити здуття та тяжкість після їжі. Здоров&apos;я серця. Дослідження на тваринах
              показують, що оцтова кислота може знижувати рівень тригліцеридів та загального
              холестерину, а також позитивно впливати на серцево-судинну систему.
            </p>

            <p>
              Антиоксидантні властивості. Завдяки вмісту антиоксидантів{' '}
              <strong>яблучний оцет</strong> допомагає боротися з вільними радикалами і може
              знижувати пошкодження клітин печінки.
            </p>
            <h2>Деякі застереження</h2>
            <p>
              Не зважаючи на усі вищенаведені властивості <strong>яблучного оцту</strong>,
              зауважимо, що деякі позитивні ефекти вимагають наукового підтвердження на великих
              вибірках людей, оскільки більшість досліджень проводилася на тваринах чи на дуже
              маленьких групах добровольців.
            </p>
            <p>
              Потенційні ризики. Вживання <strong>яблучного оцту</strong> може спричинити побічні
              ефекти, такі як подразнення стравоходу або ерозія зубної емалі. Також не
              рекомендується приймати його при виразці, грижі та гастропарезі, оскільки він
              уповільнює спорожнення шлунку. Перед вживанням оцет обов&apos;язково слід розбавляти
              водою.
            </p>
            <p>
              Важливо пам&apos;ятати, що <strong>Яблучний оцет</strong> не є ліками!{' '}
              <strong>Яблучний оцет</strong> не слід використовувати, як заміну на традиційні ліки
              для лікування серйозних захворювань. Завжди консультуйтеся з лікарем перед початком
              прийому <strong>Яблучного оцту</strong>!
            </p>
          </div>
          <p className={styles.signature}>Ваша Дар&apos;я Авдєєва 🌿</p>
        </div>

        {/* --- Додано блок для сертифікатів --- */}
        {/* <div className={styles.certificates}>
          <div className={styles.certificateWrapper}>
            <Image
              src="/certificate1.jpg" // Замініть на шлях до першого сертифіката
              alt="Сертифікат 1"
              width={140} // Встановлюємо невелику ширину
              height={190} // Встановлюємо невелику висоту
              className={styles.certificateImage}
            />
          </div>
          <div className={styles.certificateWrapper}>
            <Image
              src="/certificate2.jpg" // Замініть на шлях до другого сертифіката
              alt="Сертифікат 2"
              width={140} // Встановлюємо невелику ширину
              height={190} // Встановлюємо невелику висоту
              className={styles.certificateImage}
            />
          </div>
        </div> */}
        {/* ------------------------------------- */}
      </div>

      <div className={styles.rightSection}>
        <Image src="/about-us-2.jpg" alt="Наш маєток" fill className={styles.image} />
      </div>
    </section>
  )
}
